# -*- coding: utf-8 -*-
def response_parser(response):

    ret = ''
    for  key in response.keys():
        value = response.get(key)
    
        for i in range(len(value)):
            if key == 'rawdata':
                continue
            if key == 'hwxx':
                ret += ('==========货物信息========== \n')
                ret += response_parser(response.get(key)[0])
                ret += ('==========货物信息完==========\n')
                continue

            ret+=str(value[i])
            if i % 2 !=0:
                ret += ('\n')
                continue
            ret +=(' : ')
    return ret


if __name__ =='__main__':
    response = {'fpdm': ('发票代码', '044031700111'), 'fphm': ('发票号码', '28477743'), 'fpmc': ('发票名称', '增值税普通发票（电子）'), 'fpszd': ('发票所在地', '深圳'), 'cycs': ('查验次数', 36), 'kprq': ('开票日期', '20171129'), 'xfmc': ('销方名称', '深圳市腾讯计算机系统有限公司'), 'xfsbh': ('销方识别号', '91440300708461136T'), 'xfdzdh': ('销方地址电话', '深圳市南山区高新区高新南一路飞亚达大厦5-10楼 0755-86013388'), 'xfyhzh': ('销方银行账号', '招商银行深圳威盛大厦支行 817282299610001'), 'gfmc': ('购方名称', '邯郸市启哲教育科技有限公司'), 'gfsbh': ('购方识别号', '91130400MA097RU75G'), 'gfdzdh': ('购方地址电话', ' '), 'gfyhzh': ('购方银行账号', ' '), 'jym': ('校验码', '48987406241857227858'), 'se': ('税额', '16.98'), 'jshj': ('价税合计', '300'), 'bz': ('备注', ' '), 'jqbh': ('机器编号', '661620025119'), 'je': ('金额(不含税)', '283.02'), 'zfbz': ('作废标志', 'N'), 'cysj': ('查验时间', ' '), 'hwxx': [{'mc': ('名称', '微信认证服务费'), 'gg': ('规格', ''), 'dw': ('单位', ''), 'sl': ('税率', '6'), 'dj': ('单价', '283.01886792'), 'je': ('金额', '283.02'), 'num': ('数量', '1'), 'se': ('税额', '16.98')}], 'fplx': ('10', '增值税普通发票（电子）'), 'rawdata': '{"key1":"001","key2":"35≡20171129≡深圳市腾讯计算机系统有限公司≡91440300708461136T≡深圳市南山区高新区高新南一路飞亚达大厦5-10楼 0755-86013388≡招商银行深圳威盛大厦支行 817282299610001≡邯郸市启哲教育科技有限公司≡91130400MA097RU75G≡ ≡ ≡48987406241857227858≡16.98≡300≡≡661620025119≡283.02≡N≡ ","key3":"微信认证服务费█ █ █6█283.01886792█283.02█1█16.98","key4":" ","key5":"1"}'}
    ret = response_parser(response)
    print(ret)
